const partyColors = {
    '사회민주당': 'rgb(255, 30, 90)', // 강렬한 핫 핑크
    '자유민주연합': 'rgb(60, 140, 255)', // 선명한 블루
    '중앙당': 'rgb(255, 200, 0)', // 선명한 골드

    '국가를 위한 보수당': 'rgb(60, 60, 60)', // 진한 그레이
    '녹색당': 'rgb(0, 140, 75)', // 선명한 초록색
    '만국의 노동자여!': 'rgb(140, 140, 140)', // 밝은 그레이
    '좌파연합': 'rgb(220, 100, 40)', // 강렬한 다크 오렌지
    '통합 트라야비야': 'rgb(0, 80, 160)', // 선명한 다크 블루
    
    'LGBT 평등당': 'rgb(255, 50, 160)', // 선명한 딥 핑크
    '개혁': 'rgb(255, 150, 70)', // 밝은 오렌지
    '기본소득당': 'rgb(0, 255, 255)', // 강렬한 시안
    '농민당': 'rgb(150, 80, 30)', // 진한 브라운
    '시민이 모였다!': 'rgb(255, 245, 150)', // 밝은 라이트 옐로우
    '자유혁신당': 'rgb(110, 30, 200)', // 선명한 딥 퍼플
    '진보를 외치다': 'rgb(255, 40, 150)', // 선명한 핫 핑크
    '청년당': 'rgb(200, 90, 220)', // 밝은 오키드 퍼플
    '트라야비야 연방공화당': 'rgb(153, 0, 0)', // 진한 마룬
    '특이점이 온다': 'rgb(85, 140, 200)', // 강렬한 스틸 블루

    '공산당': 'rgb(255, 0, 40)', // 강렬한 레드
    '공정무역당': 'rgb(110, 215, 255)', // 선명한 소프트 블루
    '국가신성당': 'rgb(240, 140, 250)', // 밝은 소프트 비올렛
    '국민행동당': 'rgb(10, 10, 100)', // 선명한 다크 네이비
    '균형잡힌 미래': 'rgb(255, 255, 40)', // 선명한 라이트 옐로우
    '노인당': 'rgb(115, 115, 10)', // 선명한 올리브
    '단결하는 신앙당': 'rgb(255, 230, 230)', // 선명한 라이트 핑크
    '디지털 권리당': 'rgb(20, 60, 160)', // 진한 다크 블루
    '자연보호당': 'rgb(10, 140, 140)', // 선명한 다크 틸
    '미래?': 'rgb(0, 200, 215)', // 선명한 다크 터콰이즈
    '민주시민모임': 'rgb(112, 61, 173)', // 진한 인디고
    '보호하라!': 'rgb(255, 215, 0)', // 강렬한 옐로우 골드
    '복지추구당': 'rgb(255, 100, 20)', // 선명한 오렌지 레드
    '새희망당': 'rgb(155, 90, 50)', // 밝은 소프트 시에나
    '생명당': 'rgb(255, 192, 203)', // 밝은 라이트 핑크
    '전사회당': 'rgb(255, 10, 255)', // 강렬한 마젠타
    '정의': 'rgb(140, 0, 140)', // 선명한 퍼플
    '트라야비야 국민전선': 'rgb(105, 40, 10)', // 짙은 다크 초콜릿
    '통일당': 'rgb(255, 140, 20)', // 선명한 다크 오렌지
    '평화': 'rgb(160, 250, 160)', // 선명한 라이트 그린
    '우리는 안정을 추구한다': 'rgb(10, 140, 10)', // 선명한 그린
    '우리는 페미니스트': 'rgb(255, 120, 190)', // 선명한 핫 핑크
    '인권정의당': 'rgb(150, 10, 10)', // 진한 마룬

    '그미즈리 국민당': 'rgb(100, 200, 255)', // 밝은 스카이 블루
    '그미즈리 노동당': 'rgb(220, 190, 160)', // 밝은 탠
    '그미즈리 녹색당': 'rgb(10, 175, 150)', // 선명한 티얼 그린
    '그미즈리 민주당': 'rgb(10, 200, 200)', // 밝은 라이트 시안
    '그미즈리 보수당': 'rgb(85, 140, 200)', // 선명한 스틸 블루
    '그미즈리 사회당': 'rgb(150, 115, 200)', // 밝은 미디엄 퍼플
    '그미즈리 자유당': 'rgb(10, 50, 120)', // 진한 다크 블루
    '그미즈리 통합당': 'rgb(10, 140, 140)', // 선명한 다크 틸
    '그미즈리 혁신당': 'rgb(250, 240, 150)', // 선명한 카키
    '도마니 연합': 'rgb(240, 130, 250)', // 선명한 비올렛
    '림덴시를 위하여': 'rgb(255, 115, 80)', // 선명한 토마토
    '살기좋은 안텐시': 'rgb(10, 255, 140)', // 선명한 스프링 그린
    '세오어 보호당': 'rgb(220, 100, 100)', // 선명한 인디언 레드
    '테트라 인민당': 'rgb(180, 255, 70)', // 강렬한 라임 그린
    '하파차 자유시민': 'rgb(100, 10, 150)', // 강렬한 딥 인디고
    '하파차의 후예': 'rgb(160, 60, 250)', // 선명한 블루 바이올렛
    '하파차 민주연합': 'rgb(200, 50, 200)', // 선명한 다크 퍼플
};

export default partyColors;
