const partyColors = {
    '사회민주당': 'rgb(255, 140, 180)', // 좀 더 부드러운 핑크
    '자유민주연합': 'rgb(85, 185, 255)', // 중간 톤의 스카이 블루
    '중앙당': 'rgb(255, 223, 0)', // 골드
    '개혁당': 'rgb(255, 135, 60)', // 소프트 오렌지
    '국가를 위한 보수당': 'rgb(0, 50, 102)', // 다크 네이비
    '노동자당': 'rgb(255, 80, 0)', // 강렬한 오렌지 레드
    '좌파연합': 'rgb(204, 0, 0)', // 강한 레드
    '통합 트라야비야': 'rgb(0, 70, 150)', // 다크 블루
    '녹색당': 'rgb(0, 130, 70)', // 짙은 초록색
    '시민이 모였다!': 'rgb(255, 240, 128)', // 소프트 라이트 옐로우
    '연방공화당': 'rgb(153, 0, 0)', // 강렬한 다크 레드
    '자유혁신당': 'rgb(255, 100, 50)', // 코랄 톤
    '진보를 외치다': 'rgb(255, 20, 147)', // 핫 핑크
    '청년당': 'rgb(186, 85, 211)', // 오키드 퍼플
    '특이점이 온다': 'rgb(70, 130, 180)', // 스틸 블루
    'LGBT 평등당': 'rgb(255, 20, 147)', // 딥 핑크
    '공산당': 'rgb(255, 0, 0)', // 강렬한 레드
    '공정무역당': 'rgb(102, 205, 255)', // 소프트 블루
    '국가신성당': 'rgb(230, 130, 238)', // 소프트 비올렛
    '국민자유전선': 'rgb(175, 85, 0)', // 다크 초콜릿
    '국민행동당': 'rgb(0, 0, 85)', // 다크 네이비
    '균형잡힌 미래': 'rgb(128, 128, 128)', // 그레이
    '기본소득당': 'rgb(0, 245, 245)', // 시안
    '노인당': 'rgb(105, 105, 0)', // 올리브
    '농민당': 'rgb(139, 69, 19)', // 브라운
    '단결하는 신앙당': 'rgb(255, 220, 220)', // 부드러운 라이트 핑크
    '디지털 권리당': 'rgb(10, 50, 150)', // 다크 블루
    '자연보호당': 'rgb(0, 130, 130)', // 다크 틸
    '미래당': 'rgb(0, 180, 200)', // 다크 터콰이즈
    '민주시민모임': 'rgb(102, 51, 153)', // 인디고
    '보호하라!': 'rgb(255, 204, 0)', // 강렬한 골드
    '복지추구당': 'rgb(255, 80, 0)', // 오렌지 레드
    '새희망당': 'rgb(140, 80, 45)', // 소프트 시에나
    '생명당': 'rgb(255, 182, 193)', // 라이트 핑크
    '전사회당': 'rgb(255, 0, 255)', // 마젠타
    '정의': 'rgb(128, 0, 128)', // 퍼플
    '통일당': 'rgb(255, 130, 0)', // 다크 오렌지
    '평화': 'rgb(144, 238, 144)', // 라이트 그린
    '우리는 안정을 추구한다': 'rgb(0, 128, 0)', // 그린
    '우리는 페미니스트': 'rgb(255, 105, 180)', // 핫 핑크
    '인권정의당': 'rgb(128, 0, 0)', // 마룬
    '그미즈리 국민당': 'rgb(70, 150, 255)', // 브라이트 스카이 블루
    '그미즈리 노동당': 'rgb(210, 180, 140)', // 텐 
    '그미즈리 녹색당': 'rgb(0, 160, 136)', // 티얼 그린
    '그미즈리 민주당': 'rgb(0, 191, 191)', // 라이트 시안
    '그미즈리 보수당': 'rgb(65, 130, 180)', // 스틸 블루
    '그미즈리 사회당': 'rgb(135, 106, 180)', // 미디엄 퍼플
    '그미즈리 자유당': 'rgb(0, 40, 100)', // 다크 블루
    '그미즈리 통합당': 'rgb(51, 204, 255)', // 라이트 블루
    '그미즈리 혁신당': 'rgb(240, 230, 140)', // 카키
    '도마니 연합': 'rgb(230, 120, 238)', // 비올렛
    '림덴시를 위하여': 'rgb(255, 99, 71)', // 토마토
    '살기좋은 안텐시': 'rgb(0, 255, 127)', // 스프링 그린
    '세오어 보호당': 'rgb(205, 92, 92)', // 인디언 레드
    '테트라 인민당': 'rgb(173, 255, 47)', // 라임 그린
    '하파차의 자유민주시민': 'rgb(85, 0, 130)', // 딥 인디고
    '하파차의 후예': 'rgb(138, 43, 226)', // 블루 바이올렛
    '하파차 민주연합': 'rgb(140, 112, 219)', // 미디엄 퍼플
};

export default partyColors;
